Revit 2027 API
SlabShapeVertexType Enumeration
 The type of a SlabShapeVertex
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SlabShapeVertexType
Public Enumeration SlabShapeVertexType
public enum class SlabShapeVertexType
type SlabShapeVertexType
Members
Member name | Value | Description
Corner | 1
Edge | 2
Interior | 3
Invalid | 0
See Also
Reference
Autodesk.Revit.DB Namespace